In [1]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
unwanted= ['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked']
df.drop(unwanted,axis='columns',inplace=True)

In [5]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [6]:
x = df.drop('Survived',axis='columns')
y = df['Survived']

In [7]:
x

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [8]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

## Two Ways for Encoding the Sex attribute

## 1. Map Method

In [9]:
x1 = x
y1 = y

In [10]:
# x1.Sex = x1.Sex.map({'male': 1, 'female': 2})

In [11]:
x

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [12]:
x1.Sex = x1.Sex.map({'male':0,'female':1})

In [13]:
x1

     Pclass  Sex   Age     Fare
0         3    0  22.0   7.2500
1         1    1  38.0  71.2833
2         3    1  26.0   7.9250
3         1    1  35.0  53.1000
4         3    0  35.0   8.0500
..      ...  ...   ...      ...
886       2    0  27.0  13.0000
887       1    1  19.0  30.0000
888       3    1   NaN  23.4500
889       1    0  26.0  30.0000
890       3    0  32.0   7.7500

[891 rows x 4 columns]

In [14]:
x1.Age = x1.Age.fillna(x1.Age.mean())

In [15]:
x1

     Pclass  Sex        Age     Fare
0         3    0  22.000000   7.2500
1         1    1  38.000000  71.2833
2         3    1  26.000000   7.9250
3         1    1  35.000000  53.1000
4         3    0  35.000000   8.0500
..      ...  ...        ...      ...
886       2    0  27.000000  13.0000
887       1    1  19.000000  30.0000
888       3    1  29.699118  23.4500
889       1    0  26.000000  30.0000
890       3    0  32.000000   7.7500

[891 rows x 4 columns]

## 2. Using Label Encoding

In [16]:
from sklearn.preprocessing import LabelEncoder

In [17]:
sex_encoded = LabelEncoder()

In [18]:
x['sex'] = sex_encoded.fit_transform(x['Sex'])
x = x.drop(['Sex'],axis='columns')

In [19]:
x

     Pclass        Age     Fare  sex
0         3  22.000000   7.2500    0
1         1  38.000000  71.2833    1
2         3  26.000000   7.9250    1
3         1  35.000000  53.1000    1
4         3  35.000000   8.0500    0
..      ...        ...      ...  ...
886       2  27.000000  13.0000    0
887       1  19.000000  30.0000    1
888       3  29.699118  23.4500    1
889       1  26.000000  30.0000    0
890       3  32.000000   7.7500    0

[891 rows x 4 columns]

In [20]:
x.Age = x.Age.map(lambda x: round(x))

### Model Fitting

In [21]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2)

In [22]:
x_train.shape

(712, 4)

In [23]:
model = DecisionTreeClassifier()
model.fit(x_train,y_train)

DecisionTreeClassifier()

#### Evaluating Model with Test Size = 0.2

In [24]:
print("Score of the Model with test size 20% is ",model.score(x_test,y_test))

Score of the Model with test size 20% is  0.8100558659217877

#### Trying with Test Size 0.3

In [25]:
newmodel = DecisionTreeClassifier()

In [26]:
x_train1,x_test1,y_train1,y_test1 = train_test_split(x,y,test_size = 0.3)

In [27]:
x_train1.shape

(623, 4)

In [28]:
newmodel.fit(x_train1,y_train1)

DecisionTreeClassifier()

In [29]:
print("Score of the Model with test size 30% is ",model.score(x_test1,y_test1))

Score of the Model with test size 30% is  0.9626865671641791

# Accuracy of the Model Obtained is 96%